; TECH
[ExperimentalArmor X2TechTemplate]
DisplayName="Experimental Armor Modules"
Summary="Our autopsy of the ADVENT Shieldbearer gave us some ideas regarding new vest designs that, by incorporating recovered elerium cores, could increase soldier survivability in dramatic fashion." 

; ABILITIES
[TRGrenadePocket X2AbilityTemplate]
LocFriendlyName="Heavy Ordnance"
LocLongDescription="Unlocks grenade pocket. The grenade in your grenade-only slot gains a bonus use."
LocHelpText="Unlocks grenade pocket. The grenade in your grenade-only slot gains a bonus use."
LocPromotionPopupText="<Bullet/> All grenades are viable for Heavy Ordnance, even non-offensive grenades like Battle Scanners and Smoke Grenades.<br/>"

[TRAmmoPocket X2AbilityTemplate]
LocFriendlyName="Bandolier"
LocLongDescription="Gain a dedicated Ammo inventory slot."
LocHelpText="Gain a dedicated Ammo inventory slot."
LocPromotionPopupText="<Bullet/> Gain a dedicated Ammo inventory slot.<br/>"

[TRArmorBonus X2AbilityTemplate]
LocFriendlyName="Armor Plating"
LocLongDescription="This hefty module gives a lot of protection with penalty to mobility. Gain 3 armor and lose 1 mobility."
LocHelpText="This hefty module gives a lot of protection with penalty to mobility. Gain 3 armor and lose 1 mobility."
LocPromotionPopupText="<Bullet/> Gain bonus to armor.<br/>"

[TRMobilityBonus X2AbilityTemplate]
LocFriendlyName="Sprinter"
LocLongDescription="Swaps out some heavy pieces on the armor for lighter ones with small penalty to defense. Gain 2 mobility and lose 10 defense."
LocHelpText="Swaps out some heavy pieces on the armor for lighter ones with small penalty to defense. Gain 2 mobility and lose 10 defense."
LocPromotionPopupText="<Bullet/> Gain bonus to mobility.<br/>"

; Making a change to LW2 Ceramic Plating ability localization
[LW2WOTC_CeramicPlating_Ability X2AbilityTemplate]
LocFriendlyName="Adaptive Ceramic Plating"
LocFlyOverText="Adaptive Ceramic Plating"
LocLongDescription="You gain <Ability:CERAMIC_PLATING_HP> ablative hit points when armor upgrade slots are not used."
LocHelpText="You gain <Ability:CERAMIC_PLATING_HP> ablative hit points when armor upgrade slots are not used."

[TRPsiShield X2AbilityTemplate]
LocFriendlyName="Psi Shield"
LocLongDescription="Makes use of innate Psi potential to generate ablative hit points. Minimum of 2 ablative."
LocHelpText="Makes use of innate Psi potential to generate ablative hit points. Minimum of 2 ablative."
LocPromotionPopupText="<Bullet/> Gain bonus to ablative hit points.<br/>"

[TRAdrenalineSurge X2AbilityTemplate]
LocFriendlyName="Adreno Flight"
LocLongDescription="Gain 3 mobility for 2 turns when taking damage."
LocHelpText="Gain 3 mobility for 2 turns when taking damage."
LocPromotionPopupText="<Bullet/> Gain mobility when taking damage.<br/>"
LocFlyOverText="Adreno Flight" 

[TRSmartMod X2AbilityTemplate]
LocFriendlyName="Smart Mod"
LocLongDescription="Gain additional armor upgrade slot with no mutual exclusive rule."
LocHelpText="Gain additional armor upgrade slot with no mutual exclusive rule."
LocPromotionPopupText="<Bullet/> Gain additional armor upgrade slot.<br/>"

[TRShieldRegen X2AbilityTemplate]
LocFriendlyName="Shield Generator"
LocLongDescription="A very potent solution for the survival of our soldiers. Provides 2 ablative points and regenerates 2 points per turn for a maximum of 6."
LocHelpText="A very potent solution for the survival of our soldiers. Provides 2 ablative points and regenerates 2 points per turn for a maximum of 6."
LocPromotionPopupText="<Bullet/> Gain ablative hit points.<br/>"

[TRPlatedComp X2AbilityTemplate]
LocFriendlyName="Plated Vest Companion"
LocLongDescription="When used with Plated Vest Module, the module no longer provides armor but instead reduces incoming damage by 20%."
LocHelpText="When used with Plated Vest Module, the module no longer provides armor but instead reduces incoming damage by 20%."
LocPromotionPopupText="<Bullet/> Reduces incoming damage.<br/>"

[TRHazmatComp X2AbilityTemplate]
LocFriendlyName="Hazmat Vest Companion"
LocLongDescription="When used with Hazmat Vest Module, provides 66% damage reduction in explosive attacks."
LocHelpText="When used with Hazmat Vest Module, provides 66% damage reduction in explosive attacks."
LocPromotionPopupText="<Bullet/> Reduces incoming damage.<br/>"

[TRStasisComp X2AbilityTemplate]
LocFriendlyName="Stasis Vest Companion"
LocLongDescription="When used with Stasis Vest Module, gain additional 1 HP per turn (not counted towards Max Heal amount) and restore 10% of Will."
LocHelpText="When used with Stasis Vest Module, gain additional 1 HP per turn (not counted towards Max Heal amount) and restore 10% of Will."
LocPromotionPopupText="<Bullet/> Higher survival potential.<br/>"

; Localization for PGO Techs
[TRAU_PV_Unlock X2TechTemplate]
DisplayName="Plated Vest Module"
Summary="Shen has outfitted the traditional Nanoscale Vest with armored plating, providing an increased health boost and additional armor protection from enemy attacks."

[TRAU_HV_Unlock X2TechTemplate]
DisplayName="Hazmat Vest Module"
Summary="By reinforcing the Nanoscale Vest with specialized materials, soldiers gain an additional health boost and are completely resistant to any environmental hazards like fire, acid or poison."

[TRAU_S_Unlock X2TechTemplate]
DisplayName="Stasis Vest Module"
Summary="This upgraded Nanoscale Vest grants additional <Ability:StasisVest_BonusHP/> health to a soldier, and its built-in Medikit IV will automatically restore health to wounded soldiers."

[TRAU_HCG_Unlock X2TechTemplate]
DisplayName="Shieldwall Module"
Summary="Provide high cover to squadmates wherever you stand. Moving or attacking will cancel the effect."

[TRAU_WP_Unlock X2TechTemplate]
DisplayName="Wraith Module"
Summary="Allows the unit to pass directly through obstacles."

[TRAU_G_Unlock X2TechTemplate]
DisplayName="Grapple Module"
Summary="Deploy a grappling hook to move quickly to an elevated position."

[TRAU_GP_Unlock X2TechTemplate]
DisplayName="Heavy Ordnance Module"
Summary="Unlocks grenade pocket. The grenade in your grenade-only slot gains a bonus use."

[TRAU_AP_Unlock X2TechTemplate]
DisplayName="Bandolier Module"
Summary="Gain a dedicated Ammo inventory slot."

[TRAU_A_Unlock X2TechTemplate]
DisplayName="Armor Plating Module"
Summary="This hefty module gives a lot of protection with penalty to mobility. Gain 3 armor and lose 1 mobility."

[TRAU_M_Unlock X2TechTemplate]
DisplayName="Sprinter Module"
Summary="Swaps out some heavy pieces on the armor for lighter ones with small penalty to defense. Gain 2 mobility and lose 10 defense."

[TRAU_PS_Unlock X2TechTemplate]
DisplayName="Psi Shield Module"
Summary="Makes use of innate Psi potential to generate ablative hit points. Minimum of 2 ablative."

[TRAU_AS_Unlock X2TechTemplate]
DisplayName="Adreno Flight Module"
Summary="Gain 3 mobility for 2 turns when taking damage."

[TRAU_SR_Unlock X2TechTemplate]
DisplayName="Shield Generator Module"
Summary="A very potent solution for the survival of our soldiers. Provides 2 ablative points and regenerates 2 points per turn for a maximum of 6."

; X2Effect Uses
[X2Effect_ShieldRegeneration]
HealedMessage="+<Heal/> Shield HP Regenerated"